In [52]:
# PROBLEM STATEMENT 1 - write a SQL query that will return all the opposites of the values in the Value column. If a number is negative, make it positive and vice versa. For this problem statement, your database table is structured like this:

In [53]:
# CREATING DATABASE

Book = {
    'id' : [1, 2, 3, 4, 5],
    'Value' : [-56, 76, -84, 96, -47]
}

import sqlite3

conn = sqlite3.connect('test.db')
print("Opened database successfully")

Opened database successfully

In [54]:
# CREATING TABLE

conn.execute('''CREATE TABLE IF NOT EXISTS Book(id INTEGER, Value INTEGER);''')
conn.commit()
print('Table created successfully');

Table created successfully

In [55]:
# INSERTING VALUES - TABLE SCRIPTS

conn.execute('INSERT OR REPLACE INTO Book(id, Value) VALUES(1, -56);')
conn.execute('INSERT OR REPLACE INTO Book(id, Value) VALUES(2, 76);')
conn.execute('INSERT OR REPLACE INTO Book(id, Value) VALUES(3, -84);')
conn.execute('INSERT OR REPLACE INTO Book(id, Value) VALUES(4, 96);')
conn.execute('INSERT OR REPLACE INTO Book(id, Value) VALUES(5, -47);')

conn.commit()

In [56]:
# final solution

conn = sqlite3.connect('test.db')

cursor = conn.execute('''
SELECT id, Value,
CASE WHEN value < 0 THEN ABS(Value)
      WHEN value > 0 THEN -1*Value
      ELSE NULL
END as opp_value from Book ;''')

for row in cursor:
  print(row)
conn.close()

(1, -56, 56)
(2, 76, -76)
(3, -84, 84)
(4, 96, -96)
(5, -47, 47)
(1, -56, 56)
(2, 76, -76)
(3, -84, 84)
(4, 96, -96)
(5, -47, 47)

In [57]:
# PROBLEM STATEMENT 2 - Write a query for this that'll return just the division id's for all the divisions that had positive revenue in 2021. In this Problem statement, your database table is:

In [58]:
# CREATING DATABASE

Revenue = {
    'Division_id' : [1, 1, 1, 2, 3, 3, 4],
    'Year' : [2018, 2021, 2020, 2021, 2018, 2016, 2021],
    'Revenue' : [60, 40, 70, -10, 20, 40, 50]
}

In [59]:
# CREATING TABLE

conn = sqlite3.connect('test.db')
conn.execute('''CREATE TABLE IF NOT EXISTS Revenue(Division_id INTEGER, Year INTEGER, Revenue INTEGER);''')
conn.commit()
print('Table created successfully');

Table created successfully

In [60]:
# INSERTING RECORDS - TABLE SCRIPTS

conn.execute('INSERT OR REPLACE INTO Revenue(Division_id,Year,Revenue) VALUES(1,2018,60);')
conn.execute('INSERT OR REPLACE INTO Revenue(Division_id,Year,Revenue) VALUES(1,2021,40);')
conn.execute('INSERT OR REPLACE INTO Revenue(Division_id,Year,Revenue) VALUES(1,2020,70);')
conn.execute('INSERT OR REPLACE INTO Revenue(Division_id,Year,Revenue) VALUES(2,2021,-10);')
conn.execute('INSERT OR REPLACE INTO Revenue(Division_id,Year,Revenue) VALUES(3,2018,20);')
conn.execute('INSERT OR REPLACE INTO Revenue(Division_id,Year,Revenue) VALUES(3,2016,40);')
conn.execute('INSERT OR REPLACE INTO Revenue(Division_id,Year,Revenue) VALUES(4,2021,50);')

conn.commit()

In [61]:
# final solution

conn = sqlite3.connect('test.db')

cursor = conn.execute('''
SELECT Division_id from Revenue WHERE Year = 2021 AND Revenue > 0;''')

for row in cursor:
  print(row)

(1,)
(4,)
(1,)
(4,)

In [62]:
# PROBLEM STATEMENT 3 - Find the century for the year: Write a query that'll return the century that the year is in. In this challenge, your database table looks like this:

In [63]:
# CREATING DATABASE

Century_Year = {
    'id' : [1, 2, 3, 4, 5],
    'Year' : [1776, 2001, 1643, 1865, 1969]
}

In [64]:
# TABLE CREATION

conn.execute('''CREATE TABLE IF NOT EXISTS Century_Year(id INTEGER, Year INTEGER);''')
conn.commit()
print('Table created successfully');

Table created successfully

In [65]:
# INSERTING RECORDS

conn.execute('INSERT INTO Century_year(id, Year) VALUES(1, 1776);')
conn.execute('INSERT INTO Century_year(id, Year) VALUES(2, 2001);')
conn.execute('INSERT INTO Century_year(id, Year) VALUES(3, 1643);')
conn.execute('INSERT INTO Century_year(id, Year) VALUES(4, 1865);')
conn.execute('INSERT INTO Century_year(id, Year) VALUES(5, 1969);')

conn.commit()

In [66]:
# Final Solution

conn = sqlite3.connect('test.db')

cursor = conn.execute('''
SELECT SUBSTR(Year,1,2)+1 AS century
FROM Century_Year ''')

for row in cursor:
  print(row)
conn.close()

(18,)
(21,)
(17,)
(19,)
(20,)
(18,)
(21,)
(17,)
(19,)
(20,)

In [67]:
# PROBLEM STATEMENT 4 - Even or Odd Write a query to return whether or not the number in the value column is even or odd rather than returning the number itself. Here's the database table you'll table you'll use in this this challenge:

In [68]:
# CREATING DATABASE

Even_Odd = {
    'id' : [1, 2, 3, 4, 5],
    'Value' : [4, 11, 57, 24, 47]
}

In [69]:
# TABLE CREATION

conn = sqlite3.connect('test.db')
conn.execute('''CREATE TABLE IF NOT EXISTS Even_Odd(id INTEGER, Value INTEGER);''')
conn.commit()
print('Table created successfully');

Table created successfully

In [70]:
conn.execute('INSERT INTO Even_Odd(id, Value) VALUES(1, 4);')
conn.execute('INSERT INTO Even_Odd(id, Value) VALUES(2, 11);')
conn.execute('INSERT INTO Even_Odd(id, Value) VALUES(3, 57);')
conn.execute('INSERT INTO Even_Odd(id, Value) VALUES(4, 24);')
conn.execute('INSERT INTO Even_Odd(id, Value) VALUES(5, 47);')

conn.commit()

In [71]:
# Final Solution
conn = sqlite3.connect('test.db')

cursor = conn.execute('''
SELECT DISTINCT id, Value,
CASE WHEN Value%2 == 0 THEN 'Even'
WHEN Value%2 != 0 THEN 'Odd'
END AS category
FROM Even_Odd''')

for i in cursor:
  print(i)
conn.close()

(1, 4, 'Even')
(2, 11, 'Odd')
(3, 57, 'Odd')
(4, 24, 'Even')
(5, 47, 'Odd')

In [72]:
# PROBLEM STATEMENT 5 - GROUP BY AGE Write a query that’ll group all the people by their age, along with a count of the people that are the same age. This is the table structure that you’ll use for this SQL challenge:

In [77]:
# CREATE DATABASE

age = {
    'id' : [1, 2, 3, 4, 5, 6, 7],
    'Name' : ['Bob','Sam','Jill', 'Jim', 'Sally','Jess','Will'],
    'Age' : [21, 19, 18, 21, 19, 20, 21]
}

In [78]:
# CREATING TABLE

conn = sqlite3.connect('test.db')

conn.execute('''CREATE TABLE IF NOT EXISTS age(id INTEGER, Name TEXT, Age INTEGER);''')
conn.commit()
print('Table created successfully');

Table created successfully

In [79]:
# INSERTING RECORDS

conn.execute('INSERT INTO age(id, Name, Age) VALUES(1, "Bob", 21);')
conn.execute('INSERT INTO age(id, Name, Age) VALUES(2, "Sam", 19);')
conn.execute('INSERT INTO age(id, Name, Age) VALUES(3, "Jill", 18);')
conn.execute('INSERT INTO age(id, Name, Age) VALUES(4, "Jim", 21);')
conn.execute('INSERT INTO age(id, Name, Age) VALUES(5, "Sally", 19);')
conn.execute('INSERT INTO age(id, Name, Age) VALUES(6, "Jess", 20);')
conn.execute('INSERT INTO age(id, Name, Age) VALUES(7, "Will", 21);')

conn.commit()

In [80]:
# Final solution

conn = sqlite3.connect('test.db')

cursor = conn.execute('''
SELECT Age, COUNT(1) AS Count
FROM age
GROUP BY Age;''')

for row in cursor:
  print(row)
conn.close()

(18, 4)
(19, 8)
(20, 3)
(21, 11)